# IsReadOnly Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyParameter..::..IsReadOnly Property
FamilyParameter Class See Also
---
Identifies if the object is read-only or modifiable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override bool IsReadOnly { get; }
```

Visual Basic
---
```text
Public Overrides ReadOnly Property IsReadOnly As Boolean
	Get
```

Visual C++
---
```text
public:
virtual property bool IsReadOnly {
	bool get () override;
}
```

# ### Field Value
If true, the object may not be modified. If false, the object's contents may be modified.
# See Also
FamilyParameter Class
Autodesk.Revit.DB Namespace